In [1]:
import pandas as pd

In [5]:
model_path = "./train_test_data_models/Bengali/is_vp_succ2/out/model.txt"
mapping_csv = "./train_test_data_models/Bengali/is_vp_succ2/user_post_ffm_mapping.csv"

In [4]:
with open(model_path) as f:
    lines = f.readlines()

mapping_df = pd.read_csv(mapping_csv)

In [9]:
lines[-1]

'v_2032318_2: 0.0672455 0.103858 0.00634118 0.0540422 0.107888 0.0610173 0.081687 0.027132 0.0514431 0.0605498 0.041446 0.0469506 0.0421085 0.0981202 0.055012 0.0736013 0.0536807 0.0988239 0.0990812 0.105234 0.0200166 0.0525808 0.0477764 0.0368799 0.0752648 0.0103425 0.101112 0.0477329 0.00554791 0.0222384 0.0577089 0.0147198\n'

In [10]:
model = open(model_path, 'r').read().splitlines()
embs = {}
for s in model:
    x = s.split(': ')
    embs[x[0]] =  list(map(float, x[1].split(' ')))

In [11]:
lines[2]

'i_1: -0.797693\n'

In [12]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value_1': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value_2': [5, 6, 7, 8]})

In [15]:
df1.merge(df2, left_on='lkey', right_on='rkey', how="left")

  lkey  value_1 rkey  value_2
0  foo        1  foo        5
1  foo        1  foo        8
2  bar        2  bar        6
3  baz        3  baz        7
4  foo        5  foo        5
5  foo        5  foo        8

In [18]:
df1

  lkey  value_1
0  foo        1
1  bar        2
2  baz        3
3  foo        5

In [19]:
df2

  rkey  value_2
0  foo        5
1  bar        6
2  baz        7
3  foo        8

In [26]:
df1 = pd.DataFrame({'rkey': ['foo', 'bar', 'bazh'],
                    'value_1': [1, 2, 3]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz'],
                    'value_2': [5, 6, 7]})

In [28]:
df1.merge(df2, how="left", on="rkey")

   rkey  value_1  value_2
0   foo        1      5.0
1   bar        2      6.0
2  bazh        3      NaN

In [22]:
df1

  rkey  value_1
0  foo        1
1  bar        2
2  baz        3
3  foo        5